Repository: wolfwdavid/cross_platform_c11
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, uk, zh_hans, zh_hant

# settings.app.renameSelectsName
source: Rename Selects Existing Name
ja: 名称変更時に既存の名前を選択
ko: 이름 변경 시 기존 이름 선택
ru: Переименование выделяет имя
uk: Перейменування виділяє наявне ім'я
zh_hans: 重命名时选中现有名称
zh_hant: 重新命名時選取現有名稱

# settings.app.renameSelectsName.subtitleOff
source: Command Palette rename keeps the caret at the end.
ja: コマンドパレットの名称変更ではキャレットが末尾に置かれます。
ko: 명령어 팔레트의 이름 변경 시 커서가 끝에 위치합니다.
ru: Переименование в палитре команд оставляет курсор в конце.
uk: Перейменування в палітрі команд залишає курсор у кінці.
zh_hans: 命令面板重命名时光标保持在末尾。
zh_hant: 指令面板重新命名時，游標保持在結尾。

# settings.app.renameSelectsName.subtitleOn
source: Command Palette rename starts with all text selected.
ja: コマンドパレットの名称変更ではテキスト全体が選択された状態で始まります。
ko: 명령어 팔레트의 이름 변경 시 전체 텍스트가 선택됩니다.
ru: Переименование в палитре команд начинается с выделения всего текста.
uk: Перейменування в палітрі команд починається з виділенням усього тексту.
zh_hans: 命令面板重命名时全选文本。
zh_hant: 指令面板重新命名時，會先選取所有文字。

# settings.app.reorderOnNotification
source: Reorder on Notification
ja: 通知時に並べ替え
ko: 알림 시 순서 변경
ru: Перемещение при уведомлении
uk: Перевпорядкування при сповіщенні
zh_hans: 收到通知时重新排序
zh_hant: 收到通知時重新排序

# settings.app.reorderOnNotification.subtitle
source: Workspaces jump to the top when they ring. Disable for stable shortcut positions.
ja: ワークスペースは呼びかけると先頭へジャンプします。ショートカット位置を固定するには無効に。
ko: 작업 공간은 울릴 때 맨 위로 올라옵니다. 단축키 위치를 고정하려면 비활성화하세요.
ru: Рабочие пространства всплывают наверх, когда звенят. Отключите для стабильных позиций сочетаний клавиш.
uk: Робочі простори стрибають угору, коли гукають. Вимкніть для сталих позицій скорочень.
zh_hans: 工作区叩你时跳至顶部。禁用以保持快捷键位置稳定。
zh_hant: 工作區被叩時跳至最上方。停用以保持快捷鍵位置穩定。

# settings.app.showBranchDirectory
source: Show Branch + Directory in Sidebar
ja: サイドバーにブランチ+ディレクトリを表示
ko: 사이드바에 브랜치 + 디렉토리 표시
ru: Показывать ветку и каталог в боковой панели
uk: Показувати гілку та теку у бічній панелі
zh_hans: 在侧边栏显示分支和目录
zh_hant: 在側邊欄顯示分支與目錄

# settings.app.showBranchDirectory.subtitle
source: Show the git branch and working directory row.
ja: git ブランチと作業ディレクトリの行を表示します。
ko: git 브랜치와 작업 디렉토리 행을 표시해요.
ru: Показывать строку с git-веткой и рабочим каталогом.
uk: Показувати рядок з git-гілкою та робочою текою.
zh_hans: 显示 git 分支与工作目录那一行。
zh_hant: 顯示 git 分支與工作目錄那一列。

# settings.app.showInMenuBar
source: Show in Menu Bar
ja: メニューバーに表示
ko: 메뉴 막대에 표시
ru: Показывать в строке меню
uk: Показувати в рядку меню
zh_hans: 在菜单栏显示
zh_hant: 顯示於選單列

# settings.app.showInMenuBar.subtitle
source: Keeps c11 in the menu bar for unread counts and quick actions.
ja: 未読数とクイック操作のため、c11 をメニューバーに表示します。
ko: 읽지 않은 수와 빠른 동작을 위해 c11을 메뉴 막대에 유지합니다.
ru: Держит c11 в строке меню для счётчиков непрочитанных и быстрых действий.
uk: Тримає c11 у рядку меню для лічильників непрочитаного та швидких дій.
zh_hans: 将 c11 保留在菜单栏，便于查看未读计数和使用快捷操作。
zh_hant: 在選單列保留 c11,顯示未讀數量與快速操作。

# settings.app.showLog
source: Show Latest Log in Sidebar
ja: サイドバーに最新ログを表示
ko: 사이드바에 최신 로그 표시
ru: Показывать последний журнал в боковой панели
uk: Показувати останній журнал у бічній панелі
zh_hans: 在侧边栏显示最新日志
zh_hant: 在側邊欄顯示最新記錄

# settings.app.showLog.subtitle
source: Shows the latest log or status message.
ja: 最新のログまたはステータスメッセージを表示します。
ko: 최신 로그 또는 상태 메시지를 표시합니다.
ru: Показывает последнее сообщение журнала или статуса.
uk: Показує останнє повідомлення журналу або статусу.
zh_hans: 显示最新的日志或状态消息。
zh_hant: 顯示最新的記錄或狀態訊息。

# settings.app.showMetadata
source: Show Custom Metadata in Sidebar
ja: サイドバーにカスタムメタデータを表示
ko: 사이드바에 사용자 지정 메타데이터 표시
ru: Показывать метаданные в боковой панели
uk: Показувати свої метадані у бічній панелі
zh_hans: 在侧边栏显示自定义元数据
zh_hant: 在側邊欄顯示自訂中繼資料

# settings.app.showMetadata.subtitle
source: Shows custom metadata from report_meta, set_status, and report_meta_block.
ja: report_meta、set_status、report_meta_block からのカスタムメタデータを表示します。
ko: report_meta, set_status 및 report_meta_block의 사용자 지정 메타데이터를 표시합니다.
ru: Показывает пользовательские метаданные из report_meta, set_status и report_meta_block.
uk: Показує власні метадані з report_meta, set_status і report_meta_block.
zh_hans: 显示来自 report_meta、set_status 和 report_meta_block 的自定义元数据。
zh_hant: 顯示來自 report_meta、set_status 和 report_meta_block 的自訂中繼資料。

# settings.app.showNotificationMessage
source: Show Notification Message in Sidebar
ja: サイドバーに通知メッセージを表示
ko: 사이드바에 알림 메시지 표시
ru: Показывать сообщение уведомления в боковой панели
uk: Показувати повідомлення сповіщення у бічній панелі
zh_hans: 在侧边栏显示通知内容
zh_hant: 在側邊欄顯示通知訊息

# settings.app.showNotificationMessage.subtitle
source: Shows the latest notification under the workspace title.
ja: ワークスペースタイトルの下に最新の通知を表示します。
ko: 작업 공간 제목 아래에 최신 알림을 표시합니다.
ru: Показывает последнее уведомление под заголовком рабочего пространства.
uk: Показує останнє сповіщення під заголовком робочого простору.
zh_hans: 在工作区标题下显示最新通知。
zh_hant: 在工作區標題下方顯示最新通知。

# settings.app.showPorts
source: Show Open Ports in Sidebar
ja: サイドバーに開いているポートを表示
ko: 사이드바에 열린 포트 표시
ru: Показывать открытые порты в боковой панели
uk: Показувати відкриті порти в бічній панелі
zh_hans: 在侧边栏显示开放端口
zh_hant: 在側邊欄顯示開放的連接埠

# settings.app.showPorts.subtitle
source: Shows open ports for this workspace.
ja: このワークスペースの開いているポートを表示します。
ko: 이 작업 공간의 열린 포트를 표시합니다.
ru: Показывает открытые порты этого рабочего пространства.
uk: Показує відкриті порти цього робочого простору.
zh_hans: 显示当前工作区的开放端口。
zh_hant: 顯示此工作區的開放連接埠。

# settings.app.showProgress
source: Show Progress in Sidebar
ja: サイドバーに進捗を表示
ko: 사이드바에 진행 상황 표시
ru: Показывать прогресс в боковой панели
uk: Показувати прогрес у бічній панелі
zh_hans: 在侧边栏显示进度
zh_hant: 在側邊欄顯示進度

# settings.app.showProgress.subtitle
source: Show the progress bar set by set_progress.
ja: set_progress で設定されるプログレスバーを表示します。
ko: set_progress로 설정된 진행 표시줄을 표시해요.
ru: Показывать индикатор прогресса, заданный через set_progress.
uk: Показувати індикатор прогресу, заданий через set_progress.
zh_hans: 显示由 set_progress 设置的进度条。
zh_hant: 顯示由 set_progress 設定的進度條。

# settings.app.showPullRequests
source: Show Pull Requests in Sidebar
ja: サイドバーにプルリクエストを表示
ko: 사이드바에 Pull Request 표시
ru: Показывать запросы на слияние в боковой панели
uk: Показувати Pull Requests у бічній панелі
zh_hans: 在侧边栏显示拉取请求
zh_hant: 在側邊欄顯示 Pull Request

# settings.app.showPullRequests.subtitle
source: Shows review items (PR, MR, etc.) with status, number, and link.
ja: レビュー項目（PR、MR など）をステータス、番号、リンク付きで表示します。
ko: 상태, 번호 및 링크가 있는 리뷰 항목(PR, MR 등)을 표시합니다.
ru: Показывает элементы проверки (PR, MR и т.д.) со статусом, номером и ссылкой.
uk: Показує елементи рев'ю (PR, MR тощо) зі статусом, номером і посиланням.
zh_hans: 显示审查项（PR、MR 等），附带状态、编号与链接。
zh_hant: 顯示審查項目（PR、MR 等）,含狀態、編號和連結。

# settings.app.showSSH
source: Show SSH in Sidebar
ja: サイドバーにSSHを表示
ko: 사이드바에 SSH 표시
ru: Показывать SSH в боковой панели
uk: Показувати SSH у бічній панелі
zh_hans: 在侧边栏显示 SSH
zh_hant: 在側邊欄顯示 SSH

# settings.app.showSSH.subtitle
source: Shows the SSH target for remote workspaces on its own row.
ja: リモートワークスペースの SSH ターゲットを専用の行に表示します。
ko: 원격 작업 공간의 SSH 대상을 자체 행에 표시합니다.
ru: Показывает SSH-адрес удалённых рабочих пространств в отдельной строке.
uk: Показує ціль SSH віддалених робочих просторів окремим рядком.
zh_hans: 远程工作区的 SSH 目标单独占一行显示。
zh_hant: 在獨立一列顯示遠端工作區的 SSH 目標。

# settings.app.showWorkspaceTitlebar
source: Show Workspace Title Bar
ja: ワークスペースのタイトルバーを表示
ko: 작업 공간 제목 표시줄 표시
ru: Показывать строку заголовка рабочего пространства
uk: Показувати смугу заголовка робочого простору
zh_hans: 显示工作区标题栏
zh_hant: 顯示工作區標題列

# settings.app.showWorkspaceTitlebar.subtitleOff
source: Hide the folder and active title above pane tabs.
ja: ペインタブの上にあるフォルダ名と現在のタイトルを隠します。
ko: 페인 탭 위의 폴더와 현재 제목을 숨깁니다.
ru: Скрыть папку и активный заголовок над вкладками панелей.
uk: Приховати теку та активний заголовок над вкладками панелей.
zh_hans: 隐藏面板标签上方的文件夹和当前标题。
zh_hant: 隱藏面板標籤上方的資料夾與目前標題。

# settings.app.showWorkspaceTitlebar.subtitleOn
source: Show the folder and active title above pane tabs.
ja: ペインタブの上にフォルダ名と現在のタイトルを表示します。
ko: 페인 탭 위에 폴더와 현재 제목을 표시합니다.
ru: Показывать папку и активный заголовок над вкладками панелей.
uk: Показувати теку та активний заголовок над вкладками панелей.
zh_hans: 在面板标签上方显示文件夹和当前标题。
zh_hant: 在面板標籤上方顯示資料夾與目前標題。

# settings.app.showWorktreeBranchChips
source: Show worktree + branch chips in sidebar
ja: サイドバーにワークツリー + ブランチのチップを表示
ko: 사이드바에 워크트리 + 브랜치 칩 표시
ru: Показывать чипы worktree и ветки в боковой панели
uk: Показувати чіпи worktree та гілки у бічній панелі
zh_hans: 在侧边栏显示工作树和分支标签
zh_hant: 在側邊欄顯示工作樹與分支標籤

# settings.app.showWorktreeBranchChips.subtitle
source: Render worktree (colored-dot prefix) and branch chips on each workspace row — derived from cwd and gitfs.
ja: 各ワークスペース行にワークツリー（色付きドットのプレフィックス）とブランチのチップを表示します。cwd と gitfs から導出されます。
ko: 각 워크스페이스 행에 워크트리(컬러 점 접두사)와 브랜치 칩을 표시해요. cwd와 gitfs에서 파생됩니다.
ru: Показывать чипы worktree (с цветной точкой-префиксом) и ветки в каждой строке рабочего пространства; вычисляются из cwd и gitfs.
uk: Показувати чіпи worktree (з кольоровою крапкою-префіксом) та гілки у кожному рядку робочого простору; обчислюються з cwd та gitfs.
zh_hans: 在每个工作区行上渲染工作树（彩色圆点前缀）和分支标签,由 cwd 与 gitfs 派生。
zh_hant: 在每個工作區列上渲染工作樹（彩色圓點前綴）與分支標籤,由 cwd 與 gitfs 派生。

# settings.app.sidebarBranchLayout
source: Sidebar Branch Layout
ja: サイドバーのブランチレイアウト
ko: 사이드바 브랜치 레이아웃
ru: Макет веток в боковой панели
uk: Макет гілок у бічній панелі
zh_hans: 侧边栏分支布局
zh_hant: 側邊欄分支版面

# settings.app.sidebarBranchLayout.inline
source: Inline
ja: インライン
ko: 인라인
ru: В строку
uk: В рядок
zh_hans: 单行
zh_hant: 行內

# settings.app.sidebarBranchLayout.subtitleInline
source: Inline: all branches share one line.
ja: インライン: すべてのブランチが1行に表示されます。
ko: 인라인: 모든 브랜치가 한 줄에 표시됩니다.
ru: В строку: все ветки в одной строке.
uk: В рядок: усі гілки в одному рядку.
zh_hans: 单行：所有分支共享一行。
zh_hant: 行內：所有分支共用一行。

# settings.app.sidebarBranchLayout.subtitleVertical
source: Vertical: each branch on its own line.
ja: 縦: 各ブランチを1行ずつ表示。
ko: 세로: 브랜치당 한 줄.
ru: Вертикально: каждая ветка на отдельной строке.
uk: Вертикально: кожна гілка на своєму рядку.
zh_hans: 垂直：每个分支独占一行。
zh_hant: 垂直:每個分支獨立一行。

# settings.app.sidebarBranchLayout.vertical
source: Vertical
ja: 縦
ko: 세로
ru: Вертикально
uk: Вертикально
zh_hans: 垂直
zh_hant: 垂直

# settings.app.telemetry
source: Anonymous Telemetry
ja: 匿名のテレメトリ
ko: 익명 원격 측정
ru: Анонимная телеметрия
uk: Анонімна телеметрія
zh_hans: 匿名遥测数据
zh_hant: 匿名遙測資料

# settings.app.telemetry.subtitle
source: Shares anonymized crash and usage data to improve c11.
ja: c11 を改善するため、匿名化されたクラッシュと使用状況データを共有します。
ko: c11 개선을 위해 익명화된 충돌 및 사용 데이터를 공유합니다.
ru: Отправляет анонимные данные о сбоях и использовании для улучшения c11.
uk: Ділиться анонімізованими даними про збої та використання, щоб покращити c11.
zh_hans: 分享匿名的崩溃和使用数据以改进 c11。
zh_hant: 分享匿名的當機與使用資料來改善 c11。

# settings.app.telemetry.subtitleChanged
source: Takes effect on next launch.
ja: 次回起動時に反映されます。
ko: 다음 실행 시 적용됩니다.
ru: Вступит в силу при следующем запуске.
uk: Набуде чинності при наступному запуску.
zh_hans: 下次启动时生效。
zh_hant: 下次啟動時生效。

# settings.app.theme
source: Theme
ja: テーマ
ko: 테마
ru: Тема
uk: Тема
zh_hans: 主题
zh_hant: 主題

# settings.app.theme.openFolder
source: Open themes folder
ja: テーマフォルダを開く
ko: 테마 폴더 열기
ru: Открыть папку тем
uk: Відкрити папку тем
zh_hans: 打开主题文件夹
zh_hant: 開啟主題資料夾

# settings.app.theme.reload
source: Reload themes
ja: テーマを再読み込み
ko: 테마 다시 로드
ru: Перезагрузить темы
uk: Перезавантажити теми
zh_hans: 重新加载主题
zh_hant: 重新載入主題

# settings.app.warnBeforeQuit
source: Warn Before Quit
ja: 終了前に警告
ko: 종료 전 경고
ru: Предупреждать перед выходом
uk: Попереджати перед виходом
zh_hans: 退出前警告
zh_hant: 結束前警告

# settings.app.warnBeforeQuit.subtitleOff
source: Cmd+Q quits immediately.
ja: Cmd+Q ですぐに終了します。
ko: Cmd+Q를 누르면 즉시 종료됩니다.
ru: Cmd+Q закрывает приложение сразу.
uk: Cmd+Q закриває миттєво.
zh_hans: Cmd+Q 直接退出。
zh_hant: Cmd+Q 會立即結束。

# settings.app.warnBeforeQuit.subtitleOn
source: Cmd+Q asks before quitting.
ja: Cmd+Q は終了前に確認します。
ko: Cmd+Q는 종료 전에 확인합니다.
ru: Cmd+Q спросит перед выходом.
uk: Cmd+Q питає перед закриттям.
zh_hans: Cmd+Q 退出前先询问。
zh_hant: Cmd+Q 結束前先詢問。

# settings.appearance.c11Theme
source: c11 Theme
ja: c11テーマ
ko: c11 테마
ru: Тема c11
uk: Тема c11
zh_hans: c11 主题
zh_hant: c11 主題

# settings.appearance.c11Theme.note
source: c11 theme changes app chrome only. Ghostty terminal themes are separate.
ja: c11テーマはアプリのクロームだけを変更します。Ghosttyのターミナルテーマは別です。
ko: c11 테마는 앱 크롬만 변경합니다. Ghostty 터미널 테마는 별도입니다.
ru: Тема c11 меняет только оформление приложения. Темы терминала Ghostty — отдельно.
uk: Тема c11 змінює тільки хром застосунку. Теми терміналу Ghostty — окремо.
zh_hans: c11 主题仅改变应用外观。Ghostty 终端主题相互独立。
zh_hant: c11 主題僅變更應用外殼。Ghostty 終端機主題獨立運作。

# settings.appearance.theme.systemDay
source: When the system says day
ja: システムが昼のとき
ko: 시스템이 낮이라고 할 때
ru: Когда система говорит «день»
uk: Коли система каже «день»
zh_hans: 系统为白天时
zh_hant: 系統判定為白天時

# settings.appearance.theme.systemNight
source: When the system says night
ja: システムが夜のとき
ko: 시스템이 밤이라고 할 때
ru: Когда система говорит «ночь»
uk: Коли система каже «ніч»
zh_hans: 系统为夜晚时
zh_hant: 系統判定為夜晚時

# settings.automation.claudeCode
source: Claude Code Integration
ja: Claude Code連携
ko: Claude Code 연동
ru: Интеграция с Claude Code
uk: Інтеграція з Claude Code
zh_hans: Claude Code 集成
zh_hant: Claude Code 整合

# settings.automation.claudeCode.note
source: Wraps the claude command to inject session tracking and notification hooks. Turn off to manage Claude Code hooks yourself.
ja: claudeコマンドをラップしてセッション追跡と通知フックを挿入します。Claude Codeのフックを自分で管理するにはオフにしてください。
ko: claude 명령을 래핑하여 세션 추적 및 알림 훅을 삽입합니다. Claude Code 훅을 직접 관리하려면 끄세요.
ru: Оборачивает команду claude для внедрения хуков отслеживания сеансов и уведомлений. Отключите, чтобы управлять хуками Claude Code самостоятельно.
uk: Обгортає команду claude, щоб додати відстеження сесій і хуки сповіщень. Вимкніть, щоб керувати хуками Claude Code самостійно.
zh_hans: 包装 claude 命令以注入会话跟踪和通知钩子。关闭后可自行管理 Claude Code 钩子。
zh_hant: 包裝 claude 指令以注入工作階段追蹤和通知掛鉤。關閉即可自行管理 Claude Code 掛鉤。

# settings.automation.claudeCode.subtitleOff
source: Claude Code runs without c11 integration.
ja: Claude Codeはc11連携なしで実行されます。
ko: Claude Code가 c11 연동 없이 실행됩니다.
ru: Claude Code работает без интеграции с c11.
uk: Claude Code працює без інтеграції з c11.
zh_hans: Claude Code 在没有 c11 集成的情况下运行。
zh_hant: Claude Code 在不使用 c11 整合的情況下運行。

# settings.automation.claudeCode.subtitleOn
source: Sidebar shows Claude session status and notifications.
ja: サイドバーにClaudeセッションのステータスと通知が表示されます。
ko: 사이드바에 Claude 세션 상태와 알림이 표시됩니다.
ru: Боковая панель показывает статус сеанса Claude и уведомления.
uk: Бічна панель показує статус сеансу Claude та сповіщення.
zh_hans: 侧边栏显示 Claude 会话状态和通知。
zh_hant: 側邊欄顯示 Claude 工作階段狀態和通知。

# settings.automation.openAccess.dialog.cancel
source: Cancel
ja: キャンセル
ko: 취소
ru: Отменить
uk: Скасувати
zh_hans: 取消
zh_hant: 取消

# settings.automation.openAccess.dialog.confirm
source: Enable Full Open Access
ja: フルオープンアクセスを有効にする
ko: 전체 개방 접근 활성화
ru: Включить полный открытый доступ
uk: Увімкнути повний відкритий доступ
zh_hans: 启用完全开放访问
zh_hant: 啟用完全開放存取

# settings.automation.openAccess.dialog.message
source: Disables ancestry and password checks. Opens the socket to every local user on this Mac. Only enable if you understand the risk.
ja: 祖先プロセスチェックとパスワードチェックを無効にします。このMac上のすべてのローカルユーザーにソケットを公開します。リスクを理解した場合のみ有効にしてください。
ko: 출처 및 비밀번호 검사를 비활성화합니다. 이 Mac의 모든 로컬 사용자에게 소켓을 개방합니다. 위험을 이해한 경우에만 활성화하세요.
ru: Отключает проверку происхождения и пароля. Открывает сокет всем локальным пользователям этого Mac. Включайте, только если понимаете риски.
uk: Вимикає перевірки походження та пароля. Відкриває сокет для всіх локальних користувачів цього Mac. Вмикайте, лише якщо розумієте ризик.
zh_hans: 禁用祖先和密码检查。向本 Mac 上每个本地用户开放套接字。仅在了解风险后启用。
zh_hant: 停用來源驗證和密碼檢查，將 Socket 開放給此 Mac 上的所有本機使用者。了解風險後再啟用。

# settings.automation.openAccess.dialog.title
source: Enable full open access?
ja: フルオープンアクセスを有効にしますか？
ko: 전체 개방 접근을 활성화하시겠습니까?
ru: Включить полный открытый доступ?
uk: Увімкнути повний відкритий доступ?
zh_hans: 启用完全开放访问？
zh_hant: 要啟用完全開放存取嗎？

# settings.automation.openAccessWarning
source: Warning: Full open access makes the control socket world-readable/writable on this Mac and disables auth checks. Local debugging only.
ja: 警告: フルオープンアクセスにすると、このMac上の制御ソケットが誰でも読み書き可能になり、認証チェックが無効になります。ローカルデバッグ専用。
ko: 경고: 전체 개방 접근은 이 Mac에서 제어 소켓을 누구나 읽고 쓸 수 있게 하며 인증 검사를 비활성화합니다. 로컬 디버깅 전용.
ru: Внимание: полный открытый доступ делает управляющий сокет доступным для чтения и записи всем на этом Mac и отключает проверку авторизации. Только для локальной отладки.
uk: Попередження: повний відкритий доступ робить керуючий сокет читальним і записувальним для всіх на цьому Mac та вимикає перевірки авторизації. Лише для локального зневадження.
zh_hans: 警告：完全开放访问会使控制套接字在本 Mac 上对所有用户可读/可写，并禁用身份验证检查。仅用于本地调试。
zh_hant: 警告：完全開放存取會讓控制 Socket 在此 Mac 上可被所有人讀寫，並停用驗證檢查。僅限本機除錯使用。

# settings.automation.port.note
source: Each workspace gets a dedicated port range via CMUX_PORT and CMUX_PORT_END. New terminals inherit them.
ja: 各ワークスペースにはCMUX_PORTとCMUX_PORT_ENDで専用のポート範囲が割り当てられます。新しいターミナルはこれを継承します。
ko: 각 작업 공간은 CMUX_PORT 및 CMUX_PORT_END를 통해 전용 포트 범위를 받습니다. 새 터미널은 이 값을 상속합니다.
ru: Каждое рабочее пространство получает выделенный диапазон портов через CMUX_PORT и CMUX_PORT_END. Новые терминалы наследуют их.
uk: Кожен робочий простір отримує виділений діапазон портів через CMUX_PORT і CMUX_PORT_END. Нові термінали успадковують їх.
zh_hans: 每个工作区通过 CMUX_PORT 和 CMUX_PORT_END 获得专用端口范围。新终端将继承这些值。
zh_hant: 每個工作區透過 CMUX_PORT 和 CMUX_PORT_END 取得專用連接埠範圍。新終端機會繼承這些值。

# settings.automation.portBase
source: Port Base
ja: ポートベース
ko: 포트 기준값
ru: Базовый порт
uk: Базовий порт
zh_hans: 起始端口
zh_hant: 連接埠起始值

# settings.automation.portBase.subtitle
source: Starting port for CMUX_PORT.
ja: CMUX_PORTの開始ポート。
ko: CMUX_PORT의 시작 포트.
ru: Начальный порт для CMUX_PORT.
uk: Початковий порт для CMUX_PORT.
zh_hans: CMUX_PORT 的起始端口。
zh_hant: CMUX_PORT 的起始連接埠。

# settings.automation.portRange
source: Port Range Size
ja: ポート範囲サイズ
ko: 포트 범위 크기
ru: Размер диапазона портов
uk: Розмір діапазону портів
zh_hans: 端口范围大小
zh_hant: 連接埠範圍大小

# settings.automation.portRange.subtitle
source: Ports per workspace.
ja: ワークスペースあたりのポート数。
ko: 작업 공간당 포트 수.
ru: Портов на рабочее пространство.
uk: Портів на робочий простір.
zh_hans: 每个工作区的端口数。
zh_hant: 每個工作區的連接埠數量。

# settings.automation.socketMode
source: Socket Control Mode
ja: ソケット制御モード
ko: 소켓 제어 모드
ru: Режим управления сокетом
uk: Режим керування сокетом
zh_hans: 套接字控制模式
zh_hant: Socket 控制模式

# settings.automation.socketMode.note
source: Socket modes decide which local processes can drive c11. Automation and password widen access beyond c11-launched processes.
ja: ソケットモードは、どのローカルプロセスがc11を操作できるかを決めます。オートメーションとパスワードは、c11から起動したプロセス以外にもアクセスを広げます。
ko: 소켓 모드가 c11을 제어할 수 있는 로컬 프로세스를 결정합니다. 자동화 및 비밀번호 모드는 c11이 시작한 프로세스 이상으로 접근을 넓힙니다.
ru: Режимы сокета определяют, какие локальные процессы могут управлять c11. Режимы автоматизации и пароля расширяют доступ за пределы процессов, запущенных из c11.
uk: Режими сокета визначають, які локальні процеси можуть керувати c11. Режими автоматизації та пароля розширюють доступ за межі процесів, запущених c11.
zh_hans: 套接字模式决定哪些本地进程可以驱动 c11。自动化和密码模式会将访问范围扩展至 c11 启动的进程之外。
zh_hant: Socket 模式決定哪些本機程序可以驅動 c11。自動化和密碼模式讓 c11 啟動以外的程序也能存取。

# settings.automation.socketOverrides.note
source: Overrides: CMUX_SOCKET_ENABLE, CMUX_SOCKET_MODE, and CMUX_SOCKET_PATH (set CMUX_ALLOW_SOCKET_OVERRIDE=1 for stable/nightly builds).
ja: オーバーライド: CMUX_SOCKET_ENABLE、CMUX_SOCKET_MODE、CMUX_SOCKET_PATH（stable/nightlyビルドではCMUX_ALLOW_SOCKET_OVERRIDE=1を設定）。
ko: 재정의: CMUX_SOCKET_ENABLE, CMUX_SOCKET_MODE, CMUX_SOCKET_PATH (안정/나이틀리 빌드의 경우 CMUX_ALLOW_SOCKET_OVERRIDE=1 설정).
ru: Переопределения: CMUX_SOCKET_ENABLE, CMUX_SOCKET_MODE и CMUX_SOCKET_PATH (установите CMUX_ALLOW_SOCKET_OVERRIDE=1 для стабильных/ночных сборок).
uk: Перевизначення: CMUX_SOCKET_ENABLE, CMUX_SOCKET_MODE та CMUX_SOCKET_PATH (встановіть CMUX_ALLOW_SOCKET_OVERRIDE=1 для stable/nightly-збірок).
zh_hans: 覆盖项：CMUX_SOCKET_ENABLE、CMUX_SOCKET_MODE 和 CMUX_SOCKET_PATH（对稳定版/每日构建版需设置 CMUX_ALLOW_SOCKET_OVERRIDE=1）。
zh_hant: 覆寫設定：CMUX_SOCKET_ENABLE、CMUX_SOCKET_MODE 和 CMUX_SOCKET_PATH（穩定版/每夜版需設定 CMUX_ALLOW_SOCKET_OVERRIDE=1）。

# settings.automation.socketPassword
source: Socket Password
ja: ソケットパスワード
ko: 소켓 비밀번호
ru: Пароль сокета
uk: Пароль сокета
zh_hans: 套接字密码
zh_hant: Socket 密碼

# settings.automation.socketPassword.change
source: Change
ja: 変更
ko: 변경
ru: Изменить
uk: Змінити
zh_hans: 更改
zh_hant: 變更

# settings.automation.socketPassword.clear
source: Clear
ja: クリア
ko: 지우기
ru: Очистить
uk: Очистити
zh_hans: 清除
zh_hant: 清除

# settings.automation.socketPassword.clearFailed
source: Failed to clear password (%@).
ja: パスワードのクリアに失敗しました（%@）。
ko: 비밀번호 지우기 실패 (%@).
ru: Не удалось очистить пароль (%@).
uk: Не вдалося очистити пароль (%@).
zh_hans: 清除密码失败 (%@)。
zh_hant: 清除密碼失敗（%@）。

# settings.automation.socketPassword.cleared
source: Password cleared.
ja: パスワードをクリアしました。
ko: 비밀번호가 지워졌습니다.
ru: Пароль очищен.
uk: Пароль очищено.
zh_hans: 密码已清除。
zh_hant: 密碼已清除。

# settings.automation.socketPassword.enterFirst
source: Enter a password first.
ja: まずパスワードを入力してください。
ko: 먼저 비밀번호를 입력하세요.
ru: Сначала введите пароль.
uk: Спочатку введіть пароль.
zh_hans: 请先输入密码。
zh_hant: 請先輸入密碼。

# settings.automation.socketPassword.placeholder
source: Password
ja: パスワード
ko: 비밀번호
ru: Пароль
uk: Пароль
zh_hans: 密码
zh_hant: 密碼

# settings.automation.socketPassword.saveFailed
source: Failed to save password (%@).
ja: パスワードの保存に失敗しました（%@）。
ko: 비밀번호 저장 실패 (%@).
ru: Не удалось сохранить пароль (%@).
uk: Не вдалося зберегти пароль (%@).
zh_hans: 保存密码失败 (%@)。
zh_hant: 儲存密碼失敗（%@）。

# settings.automation.socketPassword.saved
source: Password saved.
ja: パスワードを保存しました。
ko: 비밀번호가 저장되었습니다.
ru: Пароль сохранен.
uk: Пароль збережено.
zh_hans: 密码已保存。
zh_hant: 密碼已儲存。

# settings.automation.socketPassword.set
source: Set
ja: 設定
ko: 설정
ru: Установить
uk: Встановити
zh_hans: 设置
zh_hant: 設定

# settings.automation.socketPassword.subtitleSet
source: Stored in Application Support.
ja: Application Supportに保存済み。
ko: Application Support에 저장됨.
ru: Хранится в Application Support.
uk: Зберігається в Application Support.
zh_hans: 存储在应用程序支持目录中。
zh_hant: 儲存於 Application Support。

# settings.automation.socketPassword.subtitleUnset
source: No password set. External clients stay blocked until one is configured.
ja: パスワードが設定されていません。設定するまで外部クライアントはブロックされたままです。
ko: 비밀번호가 설정되지 않았습니다. 비밀번호를 설정하기 전까지 외부 클라이언트는 차단됩니다.
ru: Пароль не установлен. Внешние клиенты остаются заблокированными до его настройки.
uk: Пароль не встановлено. Зовнішні клієнти лишаються заблокованими, доки його не налаштовано.
zh_hans: 未设置密码。外部客户端将被阻止，直到配置密码。
zh_hant: 尚未設定密碼。外部用戶端會持續封鎖，直到設定密碼為止。

# settings.blendMode.behindWindow
source: Behind Window
ja: ウインドウの背面
ko: 윈도우 뒤
ru: За окном
uk: За вікном
zh_hans: 窗口后方
zh_hant: 視窗後方

# settings.blendMode.withinWindow
source: Within Window
ja: ウインドウ内
ko: 윈도우 내
ru: Внутри окна
uk: У межах вікна
zh_hans: 窗口内部
zh_hant: 視窗內

# settings.browser.emptyImport.choose
source: Choose What to Import…
ja: 取り込む項目を選ぶ…
ko: 가져올 항목 선택…
ru: Выбрать, что импортировать…
uk: Обрати, що імпортувати…
zh_hans: 选择要导入的内容…
zh_hant: 選擇要匯入的項目…

# settings.browser.emptyImport.title
source: Import browser data
ja: ブラウザーデータを取り込む
ko: 브라우저 데이터 가져오기
ru: Импорт данных браузера
uk: Імпортувати дані браузера
zh_hans: 导入浏览器数据
zh_hant: 匯入瀏覽器資料

# settings.browser.externalPatterns
source: URLs to Always Open Externally
ja: 常に外部で開くURL
ko: 항상 외부에서 열 URL
ru: URL для открытия во внешнем браузере
uk: URL-адреси, які завжди відкривати зовні
zh_hans: 始终在外部打开的 URL
zh_hant: 一律在外部開啟的 URL
